// // Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, 
// // какое число большее, а какое меньшее.
// Console.Write("Input a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if(num1 > num2)
// {
//     Console.WriteLine("Max number = " + num1);
// }
// else{
//     Console.WriteLine("Max number = " + num2);
// }


// Задача 4: Напишите программу, которая принимает на вход 
// три числа и выдаёт максимальное из этих чисел.

